hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_enet_regs.h
/*
 * BL (RW)
 *
 * Back-Off Limit
 *  The Back-Off limit determines the random integer number (r) of slot time delays
 *  (4,096 bit times for 1000 Mbps and 512 bit times for 10/100 Mbps) for which the MAC waits before rescheduling a transmission attempt during retries after a collision.
 * This bit is applicable only in the half-duplex mode and is reserved (RO) in the full-duplex-only configuration.
 * - 00: k= min (n, 10)
 * - 01: k = min (n, 8)
 * - 10: k = min (n, 4)
 * - 11: k = min (n, 1) where n = retransmission attempt. The random integer r takes the value in the range 0 ≤ r < 2k
 */
#define ENET_MACCFG_BL_MASK (0x60U)
#define ENET_MACCFG_BL_SHIFT (5U)
#define ENET_MACCFG_BL_SET(x) (((uint32_t)(x) << ENET_MACCFG_BL_SHIFT) & ENET_MACCFG_BL_MASK)
#define ENET_MACCFG_BL_GET(x) (((uint32_t)(x) & ENET_MACCFG_BL_MASK) >> ENET_MACCFG_BL_SHIFT)

/*
 * DC (RW)
 *
 * Deferral Check
 *  When this bit is set, the deferral check function is enabled in the MAC.
 * The MAC issues a Frame Abort status, along with the excessive deferral error bit set in the transmit frame status,
 * when the transmit state machine is deferred for more than 24,288 bit times in the 10 or 100 Mbps mode.
 *  If the MAC is configured for 1000 Mbps operation or if the Jumbo frame mode is enabled in the 10 or 100 Mbps mode,
 *  the threshold for deferral is 155,680 bits times. Deferral begins when the transmitter is ready to transmit,
 * but it is prevented because of an active carrier sense signal (CRS) on GMII or MII. The defer time is not cumulative.
 * For example, if the transmitter defers for 10,000 bit times because the CRS signal is active and then the CRS signal becomes inactive,
 * the transmitter transmits and collision happens.
 * Because of collision, the transmitter needs to back off and then defer again after back off completion.
 * In such a scenario, the deferral timer is reset to 0 and it is restarted.
 */
#define ENET_MACCFG_DC_MASK (0x10U)
#define ENET_MACCFG_DC_SHIFT (4U)
#define ENET_MACCFG_DC_SET(x) (((uint32_t)(x) << ENET_MACCFG_DC_SHIFT) & ENET_MACCFG_DC_MASK)
#define ENET_MACCFG_DC_GET(x) (((uint32_t)(x) & ENET_MACCFG_DC_MASK) >> ENET_MACCFG_DC_SHIFT)

/*
 * TE (RW)
 *
 * Transmitter Enable
 *  When this bit is set, the transmit state machine of the MAC is enabled for transmission on the GMII or MII. When this bit is reset,
 *  the MAC transmit state machine is disabled after the completion of the transmission of the current frame, and does not transmit any further frames.
 */
#define ENET_MACCFG_TE_MASK (0x8U)
#define ENET_MACCFG_TE_SHIFT (3U)
#define ENET_MACCFG_TE_SET(x) (((uint32_t)(x) << ENET_MACCFG_TE_SHIFT) & ENET_MACCFG_TE_MASK)
#define ENET_MACCFG_TE_GET(x) (((uint32_t)(x) & ENET_MACCFG_TE_MASK) >> ENET_MACCFG_TE_SHIFT)

/*
 * RE (RW)
 *
 * Receiver Enable
 *  When this bit is set, the receiver state machine of the MAC is enabled for receiving frames from the GMII or MII. When this bit is reset,
 * the MAC receive state machine is disabled after the completion of the reception of the current frame, and does not receive any further frames from the GMII or MII.
 */
#define ENET_MACCFG_RE_MASK (0x4U)
#define ENET_MACCFG_RE_SHIFT (2U)
#define ENET_MACCFG_RE_SET(x) (((uint32_t)(x) << ENET_MACCFG_RE_SHIFT) & ENET_MACCFG_RE_MASK)
#define ENET_MACCFG_RE_GET(x) (((uint32_t)(x) & ENET_MACCFG_RE_MASK) >> ENET_MACCFG_RE_SHIFT)

/*
 * PRELEN (RW)
 *
 * Preamble Length for Transmit frames
 *  These bits control the number of preamble bytes that are added to the beginning of every Transmit frame.
 *  The preamble reduction occurs only when the MAC is operating in the full-duplex mode.
 * - 2'b00: 7 bytes of preamble
 * - 2'b01: 5 bytes of preamble
 * - 2'b10: 3 bytes of preamble
 * - 2'b11: Reserved
 */
#define ENET_MACCFG_PRELEN_MASK (0x3U)
#define ENET_MACCFG_PRELEN_SHIFT (0U)
#define ENET_MACCFG_PRELEN_SET(x) (((uint32_t)(x) << ENET_MACCFG_PRELEN_SHIFT) & ENET_MACCFG_PRELEN_MASK)
#define ENET_MACCFG_PRELEN_GET(x) (((uint32_t)(x) & ENET_MACCFG_PRELEN_MASK) >> ENET_MACCFG_PRELEN_SHIFT)

/* Bitfield definition for register: MACFF */
/*
 * RA (RW)
 *
 * Receive All
 *  When this bit is set, the MAC Receiver module passes all received frames, irrespective of whether they pass the address filter or not, to the Application.
 * The result of the SA or DA filtering is updated (pass or fail) in the corresponding bits in the Receive Status Word. When this bit is reset,
 * the Receiver module passes only those frames to the Application that pass the SA or DA address filter.
 */
#define ENET_MACFF_RA_MASK (0x80000000UL)
#define ENET_MACFF_RA_SHIFT (31U)
#define ENET_MACFF_RA_SET(x) (((uint32_t)(x) << ENET_MACFF_RA_SHIFT) & ENET_MACFF_RA_MASK)
#define ENET_MACFF_RA_GET(x) (((uint32_t)(x) & ENET_MACFF_RA_MASK) >> ENET_MACFF_RA_SHIFT)

/*
 * DNTU (RW)
 *
 * Drop non-TCP/UDP over IP Frames
 *  When set, this bit enables the MAC to drop the non-TCP or UDP over IP frames. The MAC forward only those frames that are processed by the Layer 4 filter.
 * When reset, this bit enables the MAC to forward all non-TCP or UDP over IP frames.
 */
#define ENET_MACFF_DNTU_MASK (0x200000UL)
#define ENET_MACFF_DNTU_SHIFT (21U)
#define ENET_MACFF_DNTU_SET(x) (((uint32_t)(x) << ENET_MACFF_DNTU_SHIFT) & ENET_MACFF_DNTU_MASK)
#define ENET_MACFF_DNTU_GET(x) (((uint32_t)(x) & ENET_MACFF_DNTU_MASK) >> ENET_MACFF_DNTU_SHIFT)

/*
 * IPFE (RW)
 *
 * Layer 3 and Layer 4 Filter Enable
 *  When set, this bit enables the MAC to drop frames that do not match the enabled Layer 3 and Layer 4 filters. If Layer 3 or Layer 4 filters are not enabled for matching,
 * this bit does not have any effect. When reset, the MAC forwards all frames irrespective of the match status of the Layer 3 and Layer 4 fields.
 */
#define ENET_MACFF_IPFE_MASK (0x100000UL)
#define ENET_MACFF_IPFE_SHIFT (20U)
#define ENET_MACFF_IPFE_SET(x) (((uint32_t)(x) << ENET_MACFF_IPFE_SHIFT) & ENET_MACFF_IPFE_MASK)
#define ENET_MACFF_IPFE_GET(x) (((uint32_t)(x) & ENET_MACFF_IPFE_MASK) >> ENET_MACFF_IPFE_SHIFT)

