hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_enet_regs.h
/*
 * ATSEN1 (RW)
 *
 * Auxiliary Snapshot 1 Enable
 * This field controls capturing the Auxiliary Snapshot Trigger 1. When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[1] input is enabled. When this bit is reset, the events on this input are ignored.
 * This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration or the selected number in the Number of IEEE 1588 Auxiliary Snapshot Inputs option is less than two.
 */
#define ENET_TS_CTRL_ATSEN1_MASK (0x4000000UL)
#define ENET_TS_CTRL_ATSEN1_SHIFT (26U)
#define ENET_TS_CTRL_ATSEN1_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_ATSEN1_SHIFT) & ENET_TS_CTRL_ATSEN1_MASK)
#define ENET_TS_CTRL_ATSEN1_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_ATSEN1_MASK) >> ENET_TS_CTRL_ATSEN1_SHIFT)

/*
 * ATSEN0 (RW)
 *
 * Auxiliary Snapshot 0 Enable
 * This field controls capturing the Auxiliary Snapshot Trigger 0. When this bit is set, the Auxiliary snapshot of event on ptp_aux_trig_i[0] input is enabled. When this bit is reset, the events on this input are ignored.
 */
#define ENET_TS_CTRL_ATSEN0_MASK (0x2000000UL)
#define ENET_TS_CTRL_ATSEN0_SHIFT (25U)
#define ENET_TS_CTRL_ATSEN0_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_ATSEN0_SHIFT) & ENET_TS_CTRL_ATSEN0_MASK)
#define ENET_TS_CTRL_ATSEN0_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_ATSEN0_MASK) >> ENET_TS_CTRL_ATSEN0_SHIFT)

/*
 * ATSFC (RW)
 *
 * Auxiliary Snapshot FIFO Clear
 * When set, it resets the pointers of the Auxiliary Snapshot FIFO. This bit is cleared when the pointers are reset and the FIFO is empty. When this bit is high, auxiliary snapshots get stored in the FIFO.
 * This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during core configuration.
 */
#define ENET_TS_CTRL_ATSFC_MASK (0x1000000UL)
#define ENET_TS_CTRL_ATSFC_SHIFT (24U)
#define ENET_TS_CTRL_ATSFC_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_ATSFC_SHIFT) & ENET_TS_CTRL_ATSFC_MASK)
#define ENET_TS_CTRL_ATSFC_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_ATSFC_MASK) >> ENET_TS_CTRL_ATSFC_SHIFT)

/*
 * TSENMACADDR (RW)
 *
 * Enable MAC address for PTP Frame Filtering
 * When set, the DA MAC address (that matches any MAC Address register) is used to filter the PTP frames when PTP is directly sent over Ethernet.
 */
#define ENET_TS_CTRL_TSENMACADDR_MASK (0x40000UL)
#define ENET_TS_CTRL_TSENMACADDR_SHIFT (18U)
#define ENET_TS_CTRL_TSENMACADDR_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSENMACADDR_SHIFT) & ENET_TS_CTRL_TSENMACADDR_MASK)
#define ENET_TS_CTRL_TSENMACADDR_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSENMACADDR_MASK) >> ENET_TS_CTRL_TSENMACADDR_SHIFT)

/*
 * SNAPTYPSEL (RW)
 *
 * Select PTP packets for Taking Snapshots
 *  These bits along with Bits 15 and 14 decide the set of PTP packet types for which snapshot needs to be taken.
 */
#define ENET_TS_CTRL_SNAPTYPSEL_MASK (0x30000UL)
#define ENET_TS_CTRL_SNAPTYPSEL_SHIFT (16U)
#define ENET_TS_CTRL_SNAPTYPSEL_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_SNAPTYPSEL_SHIFT) & ENET_TS_CTRL_SNAPTYPSEL_MASK)
#define ENET_TS_CTRL_SNAPTYPSEL_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_SNAPTYPSEL_MASK) >> ENET_TS_CTRL_SNAPTYPSEL_SHIFT)

/*
 * TSMSTRENA (RW)
 *
 * Enable Snapshot for Messages Relevant to Master
 * When set, the snapshot is taken only for the messages relevant to the master node. Otherwise, the snapshot is taken for the messages relevant to the slave node.
 */
#define ENET_TS_CTRL_TSMSTRENA_MASK (0x8000U)
#define ENET_TS_CTRL_TSMSTRENA_SHIFT (15U)
#define ENET_TS_CTRL_TSMSTRENA_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSMSTRENA_SHIFT) & ENET_TS_CTRL_TSMSTRENA_MASK)
#define ENET_TS_CTRL_TSMSTRENA_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSMSTRENA_MASK) >> ENET_TS_CTRL_TSMSTRENA_SHIFT)

/*
 * TSEVNTENA (RW)
 *
 * Enable Timestamp Snapshot for Event Messages
 * When set, the timestamp snapshot is taken only for event messages (SYNC, Delay_Req, Pdelay_Req, or Pdelay_Resp). When reset, the snapshot is taken for all messages except Announce, Management, and Signaling.
 */
#define ENET_TS_CTRL_TSEVNTENA_MASK (0x4000U)
#define ENET_TS_CTRL_TSEVNTENA_SHIFT (14U)
#define ENET_TS_CTRL_TSEVNTENA_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSEVNTENA_SHIFT) & ENET_TS_CTRL_TSEVNTENA_MASK)
#define ENET_TS_CTRL_TSEVNTENA_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSEVNTENA_MASK) >> ENET_TS_CTRL_TSEVNTENA_SHIFT)

/*
 * TSIPV4ENA (RW)
 *
 * Enable Processing of PTP Frames Sent over IPv4-UDP
 *  When set, the MAC receiver processes the PTP packets encapsulated in UDP over IPv4 packets. When this bit is clear, the MAC ignores the PTP transported over UDP-IPv4 packets. This bit is set by default.
 */
#define ENET_TS_CTRL_TSIPV4ENA_MASK (0x2000U)
#define ENET_TS_CTRL_TSIPV4ENA_SHIFT (13U)
#define ENET_TS_CTRL_TSIPV4ENA_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSIPV4ENA_SHIFT) & ENET_TS_CTRL_TSIPV4ENA_MASK)
#define ENET_TS_CTRL_TSIPV4ENA_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSIPV4ENA_MASK) >> ENET_TS_CTRL_TSIPV4ENA_SHIFT)

/*
 * TSIPV6ENA (RW)
 *
 * Enable Processing of PTP Frames Sent over IPv6-UDP
 * When set, the MAC receiver processes PTP packets encapsulated in UDP over IPv6 packets. When this bit is clear, the MAC ignores the PTP transported over UDP-IPv6 packets.
 */
#define ENET_TS_CTRL_TSIPV6ENA_MASK (0x1000U)
#define ENET_TS_CTRL_TSIPV6ENA_SHIFT (12U)
#define ENET_TS_CTRL_TSIPV6ENA_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSIPV6ENA_SHIFT) & ENET_TS_CTRL_TSIPV6ENA_MASK)
#define ENET_TS_CTRL_TSIPV6ENA_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSIPV6ENA_MASK) >> ENET_TS_CTRL_TSIPV6ENA_SHIFT)

/*
 * TSIPENA (RW)
 *
 * Enable Processing of PTP over Ethernet Frames
 * When set, the MAC receiver processes the PTP packets encapsulated directly in the Ethernet frames. When this bit is clear, the MAC ignores the PTP over Ethernet packets
 */
#define ENET_TS_CTRL_TSIPENA_MASK (0x800U)
#define ENET_TS_CTRL_TSIPENA_SHIFT (11U)
#define ENET_TS_CTRL_TSIPENA_SET(x) (((uint32_t)(x) << ENET_TS_CTRL_TSIPENA_SHIFT) & ENET_TS_CTRL_TSIPENA_MASK)
#define ENET_TS_CTRL_TSIPENA_GET(x) (((uint32_t)(x) & ENET_TS_CTRL_TSIPENA_MASK) >> ENET_TS_CTRL_TSIPENA_SHIFT)

