hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_enet_regs.h
/* Bitfield definition for register: SYST_SEC */
/*
 * TSS (RO)
 *
 * Timestamp Second
 *  The value in this field indicates the current value in seconds of the System Time maintained by the MAC.
 */
#define ENET_SYST_SEC_TSS_MASK (0xFFFFFFFFUL)
#define ENET_SYST_SEC_TSS_SHIFT (0U)
#define ENET_SYST_SEC_TSS_GET(x) (((uint32_t)(x) & ENET_SYST_SEC_TSS_MASK) >> ENET_SYST_SEC_TSS_SHIFT)

/* Bitfield definition for register: SYST_NSEC */
/*
 * TSSS (RO)
 *
 * Timestamp Sub Seconds
 *  The value in this field has the sub second representation of time, with an accuracy of 0.46 ns.
 * When Bit 9 (TSCTRLSSR) is set in Register 448 (Timestamp Control Register), each bit represents 1 ns and the maximum value is 0x3B9A_C9FF, after which it rolls-over to zero.
 */
#define ENET_SYST_NSEC_TSSS_MASK (0x7FFFFFFFUL)
#define ENET_SYST_NSEC_TSSS_SHIFT (0U)
#define ENET_SYST_NSEC_TSSS_GET(x) (((uint32_t)(x) & ENET_SYST_NSEC_TSSS_MASK) >> ENET_SYST_NSEC_TSSS_SHIFT)

/* Bitfield definition for register: SYST_SEC_UPD */
/*
 * TSS (RW)
 *
 * Timestamp Second
 *  The value in this field indicates the time in seconds to be initialized or added to the system time.
 */
#define ENET_SYST_SEC_UPD_TSS_MASK (0xFFFFFFFFUL)
#define ENET_SYST_SEC_UPD_TSS_SHIFT (0U)
#define ENET_SYST_SEC_UPD_TSS_SET(x) (((uint32_t)(x) << ENET_SYST_SEC_UPD_TSS_SHIFT) & ENET_SYST_SEC_UPD_TSS_MASK)
#define ENET_SYST_SEC_UPD_TSS_GET(x) (((uint32_t)(x) & ENET_SYST_SEC_UPD_TSS_MASK) >> ENET_SYST_SEC_UPD_TSS_SHIFT)

/* Bitfield definition for register: SYST_NSEC_UPD */
/*
 * ADDSUB (RW)
 *
 * Add or Subtract Time
 *  When this bit is set, the time value is subtracted with the contents of the update register. When this bit is reset, the time value is added with the contents of the update register.
 */
#define ENET_SYST_NSEC_UPD_ADDSUB_MASK (0x80000000UL)
#define ENET_SYST_NSEC_UPD_ADDSUB_SHIFT (31U)
#define ENET_SYST_NSEC_UPD_ADDSUB_SET(x) (((uint32_t)(x) << ENET_SYST_NSEC_UPD_ADDSUB_SHIFT) & ENET_SYST_NSEC_UPD_ADDSUB_MASK)
#define ENET_SYST_NSEC_UPD_ADDSUB_GET(x) (((uint32_t)(x) & ENET_SYST_NSEC_UPD_ADDSUB_MASK) >> ENET_SYST_NSEC_UPD_ADDSUB_SHIFT)

/*
 * TSSS (RW)
 *
 * Timestamp Sub Seconds
 * The value in this field has the sub second representation of time, with an accuracy of 0.46 ns.
 * When Bit 9 (TSCTRLSSR) is set in Register 448 (Timestamp Control Register), each bit represents 1 ns and the programmed value should not exceed 0x3B9A_C9FF.
 */
#define ENET_SYST_NSEC_UPD_TSSS_MASK (0x7FFFFFFFUL)
#define ENET_SYST_NSEC_UPD_TSSS_SHIFT (0U)
#define ENET_SYST_NSEC_UPD_TSSS_SET(x) (((uint32_t)(x) << ENET_SYST_NSEC_UPD_TSSS_SHIFT) & ENET_SYST_NSEC_UPD_TSSS_MASK)
#define ENET_SYST_NSEC_UPD_TSSS_GET(x) (((uint32_t)(x) & ENET_SYST_NSEC_UPD_TSSS_MASK) >> ENET_SYST_NSEC_UPD_TSSS_SHIFT)

/* Bitfield definition for register: TS_ADDEND */
/*
 * TSAR (RW)
 *
 * Timestamp Addend Register
 * This field indicates the 32-bit time value to be added to the Accumulator register to achieve time synchronization.
 */
#define ENET_TS_ADDEND_TSAR_MASK (0xFFFFFFFFUL)
#define ENET_TS_ADDEND_TSAR_SHIFT (0U)
#define ENET_TS_ADDEND_TSAR_SET(x) (((uint32_t)(x) << ENET_TS_ADDEND_TSAR_SHIFT) & ENET_TS_ADDEND_TSAR_MASK)
#define ENET_TS_ADDEND_TSAR_GET(x) (((uint32_t)(x) & ENET_TS_ADDEND_TSAR_MASK) >> ENET_TS_ADDEND_TSAR_SHIFT)

/* Bitfield definition for register: TGTTM_SEC */
/*
 * TSTR (RW)
 *
 * Target Time Seconds Register
 *  This register stores the time in seconds.
 * When the timestamp value matches or exceeds both Target Timestamp registers,
 * then based on Bits [6:5] of Register 459 (PPS Control Register), the MAC starts or stops the PPS signal output and generates an interrupt (if enabled).
 */
#define ENET_TGTTM_SEC_TSTR_MASK (0xFFFFFFFFUL)
#define ENET_TGTTM_SEC_TSTR_SHIFT (0U)
#define ENET_TGTTM_SEC_TSTR_SET(x) (((uint32_t)(x) << ENET_TGTTM_SEC_TSTR_SHIFT) & ENET_TGTTM_SEC_TSTR_MASK)
#define ENET_TGTTM_SEC_TSTR_GET(x) (((uint32_t)(x) & ENET_TGTTM_SEC_TSTR_MASK) >> ENET_TGTTM_SEC_TSTR_SHIFT)

/* Bitfield definition for register: TGTTM_NSEC */
/*
 * TRGTBUSY (RW)
 *
 * Target Time Register Busy
 *  The MAC sets this bit when the PPSCMD field (Bit [3:0]) in Register 459 (PPS Control Register) is programmed to 010 or 011.
 * Programming the PPSCMD field to 010 or 011, instructs the MAC to synchronize the Target Time Registers to the PTP clock domain.
 * The MAC clears this bit after synchronizing the Target Time Registers to the PTP clock domain
 * The application must not update the Target Time Registers when this bit is read as 1.
 * Otherwise, the synchronization of the previous programmed time gets corrupted. This bit is reserved when the Enable Flexible Pulse-Per-Second Output feature is not selected.
 */
#define ENET_TGTTM_NSEC_TRGTBUSY_MASK (0x80000000UL)
#define ENET_TGTTM_NSEC_TRGTBUSY_SHIFT (31U)
#define ENET_TGTTM_NSEC_TRGTBUSY_SET(x) (((uint32_t)(x) << ENET_TGTTM_NSEC_TRGTBUSY_SHIFT) & ENET_TGTTM_NSEC_TRGTBUSY_MASK)
#define ENET_TGTTM_NSEC_TRGTBUSY_GET(x) (((uint32_t)(x) & ENET_TGTTM_NSEC_TRGTBUSY_MASK) >> ENET_TGTTM_NSEC_TRGTBUSY_SHIFT)

/*
 * TTSLO (RW)
 *
 * Target Timestamp Low Register
 * This register stores the time in (signed) nanoseconds.
 * When the value of the timestamp matches the both Target Timestamp registers,
 * then based on the TRGTMODSEL0 field (Bits [6:5]) in Register 459 (PPS Control Register),
 * the MAC starts or stops the PPS signal output and generates an interrupt (if enabled).
 * This value should not exceed 0x3B9A_C9FF when Bit 9 (TSCTRLSSR) is set in Register 448 (Timestamp Control Register).
 * The actual start or stop time of the PPS signal output may have an error margin up to one unit of sub-second increment value.
 */
#define ENET_TGTTM_NSEC_TTSLO_MASK (0x7FFFFFFFUL)
#define ENET_TGTTM_NSEC_TTSLO_SHIFT (0U)
#define ENET_TGTTM_NSEC_TTSLO_SET(x) (((uint32_t)(x) << ENET_TGTTM_NSEC_TTSLO_SHIFT) & ENET_TGTTM_NSEC_TTSLO_MASK)
#define ENET_TGTTM_NSEC_TTSLO_GET(x) (((uint32_t)(x) & ENET_TGTTM_NSEC_TTSLO_MASK) >> ENET_TGTTM_NSEC_TTSLO_SHIFT)

/* Bitfield definition for register: SYSTM_H_SEC */
/*
 * TSHWR (RW)
 *
 * Timestamp Higher Word Register
 * This field contains the most significant 16-bits of the timestamp seconds value. This register is optional and can be selected using the Enable IEEE 1588 Higher Word Register option during core configuration.
 * The register is directly written to initialize the value. This register is incremented when there is an overflow from the 32-bits of the System Time - Seconds register.
 */
#define ENET_SYSTM_H_SEC_TSHWR_MASK (0xFFFFU)
#define ENET_SYSTM_H_SEC_TSHWR_SHIFT (0U)
#define ENET_SYSTM_H_SEC_TSHWR_SET(x) (((uint32_t)(x) << ENET_SYSTM_H_SEC_TSHWR_SHIFT) & ENET_SYSTM_H_SEC_TSHWR_MASK)
#define ENET_SYSTM_H_SEC_TSHWR_GET(x) (((uint32_t)(x) & ENET_SYSTM_H_SEC_TSHWR_MASK) >> ENET_SYSTM_H_SEC_TSHWR_SHIFT)

/* Bitfield definition for register: TS_STATUS */
/*
 * ATSNS (RO)
 *
 * Number of Auxiliary Timestamp Snapshots
 * This field indicates the number of Snapshots available in the FIFO. A value equal to the selected depth of FIFO (4, 8, or 16) indicates that the Auxiliary Snapshot FIFO is full.
 * These bits are cleared (to 00000) when the Auxiliary snapshot FIFO clear bit is set.
 * This bit is valid only if the Add IEEE 1588 Auxiliary Snapshot option is selected during core configuration.
 */
#define ENET_TS_STATUS_ATSNS_MASK (0x3E000000UL)
#define ENET_TS_STATUS_ATSNS_SHIFT (25U)
#define ENET_TS_STATUS_ATSNS_GET(x) (((uint32_t)(x) & ENET_TS_STATUS_ATSNS_MASK) >> ENET_TS_STATUS_ATSNS_SHIFT)

