hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_enet_regs.h
/*
 * OVFFRMCNT (RW)
 *
 * Overflow Frame Counter
 * This field indicates the number of frames missed by the application. This counter is incremented each time the MTL FIFO overflows. The counter is cleared when this register is read with mci_be_i[2] at 1’b1.
 */
#define ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_MASK (0xFFE0000UL)
#define ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_SHIFT (17U)
#define ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_SET(x) (((uint32_t)(x) << ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_SHIFT) & ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_MASK)
#define ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_GET(x) (((uint32_t)(x) & ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_MASK) >> ENET_DMA_MISS_OVF_CNT_OVFFRMCNT_SHIFT)

/*
 * MISCNTOVF (RW)
 *
 * Overflow Bit for Missed Frame Counter
 * This bit is set every time Missed Frame Counter (Bits[15:0]) overflows,
 * that is, the DMA discards an incoming frame because of the Host Receive Buffer being unavailable with the missed frame counter at maximum value. In such a scenario,
 *  the Missed frame counter is reset to all-zeros and this bit indicates that the rollover happened.
 */
#define ENET_DMA_MISS_OVF_CNT_MISCNTOVF_MASK (0x10000UL)
#define ENET_DMA_MISS_OVF_CNT_MISCNTOVF_SHIFT (16U)
#define ENET_DMA_MISS_OVF_CNT_MISCNTOVF_SET(x) (((uint32_t)(x) << ENET_DMA_MISS_OVF_CNT_MISCNTOVF_SHIFT) & ENET_DMA_MISS_OVF_CNT_MISCNTOVF_MASK)
#define ENET_DMA_MISS_OVF_CNT_MISCNTOVF_GET(x) (((uint32_t)(x) & ENET_DMA_MISS_OVF_CNT_MISCNTOVF_MASK) >> ENET_DMA_MISS_OVF_CNT_MISCNTOVF_SHIFT)

/*
 * MISFRMCNT (RW)
 *
 * Missed Frame Counter
 * This field indicates the number of frames missed by the controller because of the Host Receive Buffer being unavailable.
 * This counter is incremented each time the DMA discards an incoming frame. The counter is cleared when this register is read with mci_be_i[0] at 1’b1.
 */
#define ENET_DMA_MISS_OVF_CNT_MISFRMCNT_MASK (0xFFFFU)
#define ENET_DMA_MISS_OVF_CNT_MISFRMCNT_SHIFT (0U)
#define ENET_DMA_MISS_OVF_CNT_MISFRMCNT_SET(x) (((uint32_t)(x) << ENET_DMA_MISS_OVF_CNT_MISFRMCNT_SHIFT) & ENET_DMA_MISS_OVF_CNT_MISFRMCNT_MASK)
#define ENET_DMA_MISS_OVF_CNT_MISFRMCNT_GET(x) (((uint32_t)(x) & ENET_DMA_MISS_OVF_CNT_MISFRMCNT_MASK) >> ENET_DMA_MISS_OVF_CNT_MISFRMCNT_SHIFT)

/* Bitfield definition for register: DMA_RX_INTR_WDOG */
/*
 * RIWT (RW)
 *
 * RI Watchdog Timer Count
 * This bit indicates the number of system clock cycles multiplied by 256 for which the watchdog timer is set.
 * The watchdog timer gets triggered with the programmed value after the Rx DMA completes the transfer
 * of a frame for which the RI status bit is not set because of the setting in the corresponding descriptor RDES1[31].
 * When the watchdog timer runs out, the RI bit is set and the timer is stopped.
 * The watchdog timer is reset when the RI bit is set high because of automatic setting of RI as per RDES1[31] of any received frame.
 */
#define ENET_DMA_RX_INTR_WDOG_RIWT_MASK (0xFFU)
#define ENET_DMA_RX_INTR_WDOG_RIWT_SHIFT (0U)
#define ENET_DMA_RX_INTR_WDOG_RIWT_SET(x) (((uint32_t)(x) << ENET_DMA_RX_INTR_WDOG_RIWT_SHIFT) & ENET_DMA_RX_INTR_WDOG_RIWT_MASK)
#define ENET_DMA_RX_INTR_WDOG_RIWT_GET(x) (((uint32_t)(x) & ENET_DMA_RX_INTR_WDOG_RIWT_MASK) >> ENET_DMA_RX_INTR_WDOG_RIWT_SHIFT)

/* Bitfield definition for register: DMA_AXI_MODE */
/*
 * EN_LPI (RW)
 *
 * Enable Low Power Interface (LPI)
 * When set to 1, this bit enables the LPI mode supported by the GMAC-AXI configuration and accepts the LPI request from the AXI System Clock controller.
 * When set to 0, this bit disables the LPI mode and always denies the LPI request from the AXI System Clock controller.
 */
#define ENET_DMA_AXI_MODE_EN_LPI_MASK (0x80000000UL)
#define ENET_DMA_AXI_MODE_EN_LPI_SHIFT (31U)
#define ENET_DMA_AXI_MODE_EN_LPI_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_EN_LPI_SHIFT) & ENET_DMA_AXI_MODE_EN_LPI_MASK)
#define ENET_DMA_AXI_MODE_EN_LPI_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_EN_LPI_MASK) >> ENET_DMA_AXI_MODE_EN_LPI_SHIFT)

/*
 * LPI_XIT_FRM (RW)
 *
 * Unlock on Magic Packet or Remote Wake-Up Frame
 * When set to 1, this bit enables the GMAC-AXI to come out of the LPI mode only when the magic packet or remote wake-up frame is received.
 * When set to 0, this bit enables the GMAC-AXI to come out of LPI mode when any frame is received.
 */
#define ENET_DMA_AXI_MODE_LPI_XIT_FRM_MASK (0x40000000UL)
#define ENET_DMA_AXI_MODE_LPI_XIT_FRM_SHIFT (30U)
#define ENET_DMA_AXI_MODE_LPI_XIT_FRM_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_LPI_XIT_FRM_SHIFT) & ENET_DMA_AXI_MODE_LPI_XIT_FRM_MASK)
#define ENET_DMA_AXI_MODE_LPI_XIT_FRM_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_LPI_XIT_FRM_MASK) >> ENET_DMA_AXI_MODE_LPI_XIT_FRM_SHIFT)

/*
 * WR_OSR_LMT (RW)
 *
 * AXI Maximum Write Outstanding Request Limit
 * This value limits the maximum outstanding request on the AXI write interface.
 * Maximum outstanding requests = WR_OSR_LMT+1 Note: - Bit 22 is reserved if AXI_GM_MAX_WR_REQUESTS = 4. - Bit 23 bit is reserved if AXI_GM_MAX_WR_REQUESTS != 16.
 */
#define ENET_DMA_AXI_MODE_WR_OSR_LMT_MASK (0xF00000UL)
#define ENET_DMA_AXI_MODE_WR_OSR_LMT_SHIFT (20U)
#define ENET_DMA_AXI_MODE_WR_OSR_LMT_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_WR_OSR_LMT_SHIFT) & ENET_DMA_AXI_MODE_WR_OSR_LMT_MASK)
#define ENET_DMA_AXI_MODE_WR_OSR_LMT_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_WR_OSR_LMT_MASK) >> ENET_DMA_AXI_MODE_WR_OSR_LMT_SHIFT)

/*
 * RD_OSR_LMT (RW)
 *
 * AXI Maximum Read Outstanding Request Limit
 * This value limits the maximum outstanding request on the AXI read interface.
 * Maximum outstanding requests = RD_OSR_LMT+1 Note: - Bit 18 is reserved if AXI_GM_MAX_RD_REQUESTS = 4. - Bit 19 is reserved if AXI_GM_MAX_RD_REQUESTS != 16.
 */
#define ENET_DMA_AXI_MODE_RD_OSR_LMT_MASK (0xF0000UL)
#define ENET_DMA_AXI_MODE_RD_OSR_LMT_SHIFT (16U)
#define ENET_DMA_AXI_MODE_RD_OSR_LMT_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_RD_OSR_LMT_SHIFT) & ENET_DMA_AXI_MODE_RD_OSR_LMT_MASK)
#define ENET_DMA_AXI_MODE_RD_OSR_LMT_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_RD_OSR_LMT_MASK) >> ENET_DMA_AXI_MODE_RD_OSR_LMT_SHIFT)

